ViniBR01/stm32-bare-metal/examples/cli/test_harness.c
/**
 * @file test_harness.c
 * @brief Unity test harness for hardware-in-the-loop testing
 *
 * This file contains Unity-based tests that run on the STM32 target hardware.
 * Only compiled when HIL_TEST_MODE is defined (via HIL_TEST=1 build flag).
 *
 * Test coverage strategy:
 *
 *   Tier 1 — Smoke tests: all 5 SPI interfaces at max speed (prescaler 2,
 *            256 bytes), both polled and DMA. Verifies every SPI instance
 *            is functional with loopback cables.
 *
 *   Tier 2 — Deep sweep on one SPI per bus:
 *            - SPI2 (APB1, 50 MHz bus → 25 MHz SPI max)
 *            - SPI1 (APB2, 100 MHz bus → 50 MHz SPI max)
 *            Covers multiple prescaler values and buffer sizes to
 *            characterize throughput across the operating range.
 *
 *   Tier 3 — Non-SPI hardware tests (FPU, etc.)
 *
 *   Tier 4 — RCC clock tree and Timer accuracy tests.
 *
 *   Tier 5 — UART, GPIO output/input loopback and EXTI interrupt tests.
 *            GPIO loopback pairs (same wires as UART loopback):
 *              PA9 (output) <-> PB7 (input)  — UART1 loopback cable
 *              PC6 (output) <-> PC7 (input)  — UART6 loopback cable
 *            EXTI tests use PA9→PB7 pair (EXTI line 7, port B):
 *              rising edge, falling edge, and software trigger.
 */

#ifdef HIL_TEST_MODE

#include "unity.h"
#include "spi_perf.h"
#include "test_output.h"
#include "printf.h"
#include "printf_dma.h"
#include "rcc.h"
#include "timer.h"
#include "systick.h"
#include "gpio_handler.h"
#include "exti_handler.h"
#include "flash.h"
#include "crc.h"
#include "sleep_mode.h"
#include "stm32f4xx.h"  /* DWT / CoreDebug for cycle counting */

/* ====================================================================
 * UART loopback test helpers
 *
 * Two loopback pairs are wired on the board:
 *   USART1: PA9 (TX, AF7) <-> PB7 (RX, AF7)
 *   USART6: PC6 (TX, AF8) <-> PC7 (RX, AF8)
 *
 * Both UARTs are on APB2 (100 MHz).
 * BRR = (100_000_000 + 57_600) / 115_200 = 868.
 *
 * Tests use polled TX/RX with a generous timeout guard so that a
 * disconnected jumper produces a clean FAIL rather than a hang.
 * ==================================================================== */

#define UART_LB_SR_TXE    (1U << 7)
#define UART_LB_SR_RXNE   (1U << 5)
#define UART_LB_CR1_UE    (1U << 13)
#define UART_LB_CR1_TE    (1U << 3)
#define UART_LB_CR1_RE    (1U << 2)
#define UART_LB_BRR       868U          /* 115200 baud @ APB2 100 MHz */
#define UART_LB_TIMEOUT   1000000U      /* ~10 ms spin at 100 MHz     */

static void uart_lb_init_usart1(void)
{
    /* Clocks: GPIOA (PA9), GPIOB (PB7), USART1 */
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN | RCC_AHB1ENR_GPIOBEN;
    RCC->APB2ENR |= RCC_APB2ENR_USART1EN;

    /* PA9: AF7 (USART1_TX) — MODER bits [19:18] = 10, AFR[1] bits [7:4] = 7 */
    GPIOA->MODER  = (GPIOA->MODER  & ~(3U << 18)) | (2U << 18);
    GPIOA->AFR[1] = (GPIOA->AFR[1] & ~(0xFU << 4)) | (7U << 4);

    /* PB7: AF7 (USART1_RX) — MODER bits [15:14] = 10, AFR[0] bits [31:28] = 7 */
    GPIOB->MODER  = (GPIOB->MODER  & ~(3U << 14)) | (2U << 14);
    GPIOB->AFR[0] = (GPIOB->AFR[0] & ~(0xFU << 28)) | (7U << 28);

    /* USART1: 115200 baud, 8N1, TX+RX enabled */
    USART1->CR1 = 0;
    USART1->BRR = UART_LB_BRR;
    USART1->CR1 = UART_LB_CR1_TE | UART_LB_CR1_RE | UART_LB_CR1_UE;
}

static void uart_lb_init_usart6(void)
{
    /* Clocks: GPIOC (PC6, PC7), USART6 */
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN;
    RCC->APB2ENR |= RCC_APB2ENR_USART6EN;

    /* PC6: AF8 (USART6_TX) — MODER bits [13:12] = 10, AFR[0] bits [27:24] = 8 */
    GPIOC->MODER  = (GPIOC->MODER  & ~(3U << 12)) | (2U << 12);
    GPIOC->AFR[0] = (GPIOC->AFR[0] & ~(0xFU << 24)) | (8U << 24);

    /* PC7: AF8 (USART6_RX) — MODER bits [15:14] = 10, AFR[0] bits [31:28] = 8 */
    GPIOC->MODER  = (GPIOC->MODER  & ~(3U << 14)) | (2U << 14);
    GPIOC->AFR[0] = (GPIOC->AFR[0] & ~(0xFU << 28)) | (8U << 28);

    /* USART6: 115200 baud, 8N1, TX+RX enabled */
    USART6->CR1 = 0;
    USART6->BRR = UART_LB_BRR;
    USART6->CR1 = UART_LB_CR1_TE | UART_LB_CR1_RE | UART_LB_CR1_UE;
}

/* Returns 1 on success, 0 on timeout */
static int uart_lb_send(USART_TypeDef *u, uint8_t byte)
{
    uint32_t n = UART_LB_TIMEOUT;
    while (!(u->SR & UART_LB_SR_TXE)) { if (!--n) return 0; }
    u->DR = byte;
    return 1;
}

/* Returns 1 on success, 0 on timeout */
static int uart_lb_recv(USART_TypeDef *u, uint8_t *out)
{
    uint32_t n = UART_LB_TIMEOUT;
    while (!(u->SR & UART_LB_SR_RXNE)) { if (!--n) return 0; }
    *out = (uint8_t)(u->DR & 0xFFU);
    return 1;
}

/* Send one byte and receive it back; assert both operations succeed and
 * that the received value matches what was sent. */
static void uart_lb_check(USART_TypeDef *u, uint8_t byte)
{
    uint8_t rx = ~byte;
    TEST_ASSERT_MESSAGE(uart_lb_send(u, byte), "TX timeout — check jumper");
    TEST_ASSERT_MESSAGE(uart_lb_recv(u, &rx),  "RX timeout — check jumper");
    TEST_ASSERT_EQUAL_HEX8(byte, rx);
}

/* ====================================================================
 * Parameterized SPI test infrastructure
 * ==================================================================== */

typedef struct {
    spi_instance_t instance;
    uint16_t       prescaler;
    uint16_t       buffer_size;
    uint8_t        use_dma;
} spi_test_params_t;

static spi_test_params_t current_spi_params;

static void run_spi_test(void) {
    int result = spi_perf_run(
        current_spi_params.instance,
        current_spi_params.prescaler,
        current_spi_params.buffer_size,
        current_spi_params.use_dma);
    TEST_ASSERT_EQUAL_MESSAGE(0, result, "spi_perf_run failed");
}

/**
 * @brief Helper macro to define and run a parameterized SPI test.
 *
 * Unity's RUN_TEST requires a void(void) function pointer and captures
 * __LINE__ for reporting.  We store parameters in a static struct and
 * call a common runner.  The macro expands to a single RUN_TEST call
 * so Unity reports the correct line number.
 */
#define RUN_SPI_TEST(inst, psc, bufsz, dma) do {           \
    current_spi_params.instance    = (inst);                \
    current_spi_params.prescaler   = (psc);                 \
    current_spi_params.buffer_size = (bufsz);               \
    current_spi_params.use_dma     = (dma);                 \
    RUN_TEST(run_spi_test);                                 \
} while (0)

/* ====================================================================
 * Unity setup / teardown
 * ==================================================================== */

