ViniBR01/stm32-bare-metal/examples/cli/test_harness.c
#define EXTI_LB_TIMEOUT_CYCLES  100000U

/**
 * @brief Spin until g_exti9_5_count exceeds prev_count, or timeout.
 * @return 1 if count increased, 0 on timeout.
 */
static int exti_lb_wait_count(uint32_t prev_count)
{
    uint32_t n = EXTI_LB_TIMEOUT_CYCLES;
    while (n--) {
        if (g_exti9_5_count != prev_count) return 1;
    }
    return 0;
}

void test_exti_both_edges_pb7(void)
{
    gpio_lb_init_pa9_pb7();
    gpio_clear_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();

    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_BOTH,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt(PB7, BOTH) failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Rising edge */
    gpio_set_pin(GPIO_PORT_A, 9);
    int fired_rising = exti_lb_wait_count(prev);
    prev = g_exti9_5_count;

    /* Falling edge */
    gpio_clear_pin(GPIO_PORT_A, 9);
    int fired_falling = exti_lb_wait_count(prev);

    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_lb_deinit_pa9_pb7();

    TEST_ASSERT_MESSAGE(fired_rising,
        "EXTI BOTH: rising edge did not fire — check jumper PA9<->PB7");
    TEST_ASSERT_MESSAGE(fired_falling,
        "EXTI BOTH: falling edge did not fire — check jumper PA9<->PB7");
}

void test_exti_software_trigger_pb7(void)
{
    /* Software trigger: no loopback cable required.
     * Writes to EXTI->SWIER to generate a synthetic rising edge.
     * The EXTI9_5_IRQHandler defined above will fire and increment
     * g_exti9_5_count, confirming end-to-end EXTI machinery works.  */
    gpio_clock_enable(GPIO_PORT_B);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_INPUT);

    /* Enable SYSCFG clock (needed by exti_configure_gpio_interrupt) */
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    /* Configure for rising edge, interrupt mode */
    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_RISING,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt for software trigger test failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Fire software trigger */
    int sw_ret = exti_software_trigger(7);
    TEST_ASSERT_EQUAL_MESSAGE(0, sw_ret,
        "exti_software_trigger(7) returned error");

    /* Wait for ISR to fire */
    int fired = exti_lb_wait_count(prev);

    /* Cleanup */
    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_ANALOG);

    TEST_ASSERT_MESSAGE(fired,
        "EXTI software trigger: ISR did not fire");
}

/* ====================================================================
 * Flash hardware tests — Tier 6
 *
 * Uses sector 4 (0x08010000, 64 KB) as the test area. Sector 4 starts
 * at the 64 KB offset, safely beyond the HIL firmware (~38 KB in
 * sectors 0–2). Sectors 0–3 contain application code and must NOT be
 * erased while the firmware is running.
 *
 * Wear-levelling strategy: a SINGLE erase per test run. The first test
 * erases + verifies, subsequent tests write to different offsets within
 * the already-erased sector. This gives ~10K CI runs before the sector
 * wears out (STM32F411 flash endurance spec).
 * ==================================================================== */

#define FLASH_TEST_SECTOR     4U
#define FLASH_TEST_BASE_ADDR  0x08010000U

void test_flash_erase_sector1(void)
{
    err_t ret = flash_unlock();
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_unlock() failed");

    ret = flash_erase_sector(FLASH_TEST_SECTOR);
    flash_lock();
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_erase_sector(1) failed");

    /* Verify erased state: first 32 bytes should all be 0xFF */
    uint8_t buf[32];
    flash_read_bytes(FLASH_TEST_BASE_ADDR, buf, sizeof(buf));
    for (uint32_t i = 0; i < sizeof(buf); i++) {
        TEST_ASSERT_EQUAL_HEX8_MESSAGE(0xFF, buf[i],
            "Erased flash byte not 0xFF");
    }
}

void test_flash_write_word_readback(void)
{
    /* Write to offset 0x00 and 0x04 (already erased by previous test) */
    flash_unlock();

    err_t ret = flash_write_word(FLASH_TEST_BASE_ADDR, 0xDEADBEEFU);
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_write_word() failed");

    ret = flash_write_word(FLASH_TEST_BASE_ADDR + 4U, 0xCAFEBABEU);
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_write_word(+4) failed");

    flash_lock();

    uint32_t val0, val1;
    flash_read_word(FLASH_TEST_BASE_ADDR, &val0);
    flash_read_word(FLASH_TEST_BASE_ADDR + 4U, &val1);

    TEST_ASSERT_EQUAL_HEX32_MESSAGE(0xDEADBEEFU, val0,
        "Word readback mismatch at base");
    TEST_ASSERT_EQUAL_HEX32_MESSAGE(0xCAFEBABEU, val1,
        "Word readback mismatch at base+4");
}

void test_flash_write_bytes_readback(void)
{
    /* Write to offset 0x100 to avoid clobbering the word test above */
    const uint32_t addr = FLASH_TEST_BASE_ADDR + 0x100U;

    static const uint8_t pattern[] = {
        0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08,
        0xA0, 0xB0, 0xC0, 0xD0, 0xE0, 0xF0, 0x55, 0xAA
    };

    flash_unlock();
    err_t ret = flash_write_bytes(addr, pattern, sizeof(pattern));
    flash_lock();
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, ret, "flash_write_bytes() failed");

    uint8_t readback[16];
    flash_read_bytes(addr, readback, sizeof(readback));
    TEST_ASSERT_EQUAL_HEX8_ARRAY_MESSAGE(pattern, readback, sizeof(pattern),
        "Byte pattern readback mismatch");
}

void test_flash_sector_info(void)
{
    TEST_ASSERT_EQUAL_HEX32(0x08010000U, flash_get_sector_address(4));
    TEST_ASSERT_EQUAL_UINT32(64U * 1024U, flash_get_sector_size(4));
}

/* ====================================================================
 * CRC hardware tests — Tier 7
 *
 * The STM32F411 CRC peripheral uses polynomial 0x04C11DB7 (MPEG-2),
 * initial value 0xFFFFFFFF, no output XOR, no bit reversal.
 * Pure internal peripheral — no external wiring required.
 * ==================================================================== */

/* Software CRC-32/MPEG-2 reference for cross-validation */
static uint32_t sw_crc32_mpeg2_word(const uint32_t *data, uint32_t len)
{
    uint32_t crc = 0xFFFFFFFFU;
    for (uint32_t i = 0; i < len; i++) {
        crc ^= data[i];
        for (int bit = 0; bit < 32; bit++) {
            if (crc & 0x80000000U) {
                crc = (crc << 1) ^ 0x04C11DB7U;
            } else {
                crc = crc << 1;
            }
        }
    }
    return crc;
}

void test_crc_hw_known_vector(void)
{
    static const uint32_t vec[] = {0x00000001, 0x00000002, 0x00000003,
                                   0x04050607, 0x08090A0B, 0x0C0D0E0F};
    uint32_t expected = sw_crc32_mpeg2_word(vec, 6);

    crc_init();
    crc_reset();
    uint32_t hw_result = crc_accumulate(vec, 6);

    TEST_ASSERT_EQUAL_HEX32_MESSAGE(expected, hw_result,
        "HW CRC does not match software reference for known vector");
}

void test_crc_hw_reset_restores_init(void)
{
    static const uint32_t data[] = {0xDEADBEEF, 0xCAFEBABE};
    crc_init();
    crc_accumulate(data, 2);

