ViniBR01/stm32-bare-metal/examples/cli/test_harness.c
    crc_reset();
    uint32_t result = crc_get_result();
    TEST_ASSERT_EQUAL_HEX32_MESSAGE(0xFFFFFFFFU, result,
        "CRC reset did not restore accumulator to 0xFFFFFFFF");
}

void test_crc_hw_accumulate_matches_sequential(void)
{
    static const uint32_t data[] = {0x11223344, 0x55667788, 0x99AABBCC, 0xDDEEFF00};

    crc_init();
    crc_reset();
    uint32_t bulk = crc_accumulate(data, 4);

    crc_reset();
    for (uint32_t i = 0; i < 4; i++) {
        crc_accumulate(&data[i], 1);
    }
    uint32_t sequential = crc_get_result();

    TEST_ASSERT_EQUAL_HEX32_MESSAGE(bulk, sequential,
        "Bulk accumulate != sequential word-by-word");
}

void test_crc_hw_flash_region(void)
{
    crc_init();
    crc_reset();
    uint32_t result1 = crc_accumulate((const uint32_t *)0x08000000U, 256);

    TEST_ASSERT_NOT_EQUAL_HEX32_MESSAGE(0U, result1,
        "CRC of flash region should not be zero");
    TEST_ASSERT_NOT_EQUAL_HEX32_MESSAGE(0xFFFFFFFFU, result1,
        "CRC of flash region should not be init value");

    /* Determinism: same input must give same output */
    crc_reset();
    uint32_t result2 = crc_accumulate((const uint32_t *)0x08000000U, 256);
    TEST_ASSERT_EQUAL_HEX32_MESSAGE(result1, result2,
        "CRC of same flash region not deterministic");
}

void test_crc_hw_performance(void)
{
    static uint32_t perf_buf[1024];
    for (uint32_t i = 0; i < 1024; i++) {
        perf_buf[i] = i * 0x01010101U;
    }

    /* Enable DWT cycle counter */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;

    crc_init();
    crc_reset();

    uint32_t start = DWT->CYCCNT;
    crc_accumulate(perf_buf, 1024);
    uint32_t elapsed = DWT->CYCCNT - start;

    /* CRC peripheral takes 4 AHB cycles per word. With loop overhead
     * (load, store, branch), expect ~6 cycles/word = ~6144 for 1024 words.
     * Allow generous margin for pipeline and flash wait states. */
    TEST_ASSERT_UINT32_WITHIN_MESSAGE(
        3000U, 6200U, elapsed,
        "CRC of 1024 words took too many cycles");

    printf("  [perf] CRC 1024 words: %lu cycles (%.1f cycles/word)\n",
           (unsigned long)elapsed, (float)elapsed / 1024.0f);
}

/* ====================================================================
 * Stop mode test — Tier 8
 *
 * Uses EXTI software trigger on line 7 (PB7) to wake immediately from
 * Stop mode without external wiring or hang risk. After wake, the PLL
 * is restored to 100 MHz and systick re-initialised.
 * ==================================================================== */

void test_stop_mode_enter_and_wake(void)
{
    /* Configure PB7 as input, enable EXTI line 7 rising edge */
    gpio_clock_enable(GPIO_PORT_B);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_INPUT);
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_RISING,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret, "EXTI config for stop wake failed");

    /* Set EXTI pending via software trigger so WFI wakes immediately */
    exti_software_trigger(7);

    /* Enter Stop mode — wakes immediately due to pending EXTI */
    enter_stop_mode();

    /* Restore PLL to 100 MHz (Stop mode reverts to HSI) */
    rcc_init(RCC_CLK_SRC_HSI, 100000000U);
    systick_init();

    /* Verify clock restored */
    TEST_ASSERT_EQUAL_UINT32_MESSAGE(100000000U, rcc_get_sysclk(),
        "SYSCLK not restored to 100 MHz after Stop mode wake");

    /* Cleanup EXTI */
    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_ANALOG);
}

/* ====================================================================
 * Main test runner
 * ==================================================================== */

int run_unity_tests(void) {
    UNITY_BEGIN();

    /* ----------------------------------------------------------
     * Tier 1: Smoke test — all 5 SPIs at max speed
     *   prescaler=2, 256 bytes, polled + DMA
     * ---------------------------------------------------------- */
    printf("\n--- Tier 1: All-SPI smoke (psc=2, 256B) ---\n");
    printf_dma_flush();

    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 256, 0);   /* SPI1 polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 256, 1);   /* SPI1 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 256, 0);   /* SPI2 polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 256, 1);   /* SPI2 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_3, 2, 256, 0);   /* SPI3 polled */
    RUN_SPI_TEST(SPI_INSTANCE_3, 2, 256, 1);   /* SPI3 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_4, 2, 256, 0);   /* SPI4 polled */
    RUN_SPI_TEST(SPI_INSTANCE_4, 2, 256, 1);   /* SPI4 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_5, 2, 256, 0);   /* SPI5 polled */
    RUN_SPI_TEST(SPI_INSTANCE_5, 2, 256, 1);   /* SPI5 DMA    */

    /* ----------------------------------------------------------
     * Tier 2a: Deep sweep — SPI2 (APB1, 50 MHz bus)
     *   Prescaler sweep: 2, 4, 8, 16, 32, 64, 128, 256
     *   Buffer sizes: 1, 4, 16, 64, 256
     *   Both polled and DMA
     *
     *   Full matrix is 8×5×2 = 80 tests. We select a representative
     *   subset: all prescalers at 256B, all sizes at prescaler=2,
     *   plus DMA mirrors. This gives thorough coverage with ~30 tests.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 2a: SPI2 (APB1 50MHz) deep sweep ---\n");
    printf_dma_flush();

    /* Prescaler sweep at 256 bytes — polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 4,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 8,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 16,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 32,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 64,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 128, 256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 256, 256, 0);

    /* Prescaler sweep at 256 bytes — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 4,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 8,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 16,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 32,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 64,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 128, 256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 256, 256, 1);

    /* Buffer size sweep at prescaler=2 — polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 1,   0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 4,   0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 16,  0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 64,  0);

    /* Buffer size sweep at prescaler=2 — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 1,   1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 4,   1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 16,  1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 64,  1);

    /* ----------------------------------------------------------
     * Tier 2b: Deep sweep — SPI1 (APB2, 100 MHz bus)
     *   Same test matrix structure as SPI2.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 2b: SPI1 (APB2 100MHz) deep sweep ---\n");
    printf_dma_flush();

    /* Prescaler sweep at 256 bytes — polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 4,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 8,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 16,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 32,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 64,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 128, 256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 256, 256, 0);

    /* Prescaler sweep at 256 bytes — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 4,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 8,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 16,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 32,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 64,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 128, 256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 256, 256, 1);

    /* Buffer size sweep at prescaler=2 — polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 1,   0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 4,   0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 16,  0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 64,  0);

    /* Buffer size sweep at prescaler=2 — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 1,   1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 4,   1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 16,  1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 64,  1);

    /* ----------------------------------------------------------
     * Tier 3: Non-SPI hardware tests
     * ---------------------------------------------------------- */
    printf("\n--- Tier 3: FPU tests ---\n");
    printf_dma_flush();

    RUN_TEST(test_fpu_multiplication);
    RUN_TEST(test_fpu_division);

    /* ----------------------------------------------------------
     * Tier 4: RCC and Timer hardware tests
     * ---------------------------------------------------------- */
    printf("\n--- Tier 4: RCC clock tree ---\n");
    printf_dma_flush();

    RUN_TEST(test_rcc_sysclk_is_100mhz);
    RUN_TEST(test_rcc_apb1_clk_is_50mhz);
    RUN_TEST(test_rcc_apb2_clk_is_100mhz);
    RUN_TEST(test_rcc_apb1_timer_clk_is_100mhz);

    printf("\n--- Tier 4: Timer delay accuracy ---\n");
    printf_dma_flush();

    RUN_TEST(test_timer_delay_us_accuracy);

    /* ----------------------------------------------------------
     * Tier 4: SysTick tests
     *   systick_init() is called by main() at startup, so the counter
     *   is already running when these tests execute.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 4: SysTick tests ---\n");
    printf_dma_flush();

    RUN_TEST(test_systick_get_ms_increments);
    RUN_TEST(test_systick_elapsed_since);
    RUN_TEST(test_systick_delay_ms_accuracy);

    /* ----------------------------------------------------------
     * Tier 5: UART loopback hardware tests
     *   USART1: PA9 (TX/AF7) wired to PB7 (RX/AF7)
     *   USART6: PC6 (TX/AF8) wired to PC7 (RX/AF8)
     *   115200 baud, polled, no DMA/interrupts.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: USART1 loopback (PA9/PB7) ---\n");
    printf_dma_flush();

