ViniBR01/stm32-bare-metal/examples/cli/test_harness.c
    RUN_TEST(test_usart1_loopback_0xa5);
    RUN_TEST(test_usart1_loopback_0x00);
    RUN_TEST(test_usart1_loopback_0xff);
    RUN_TEST(test_usart1_loopback_sequence);

    printf("\n--- Tier 5: USART6 loopback (PC6/PC7) ---\n");
    printf_dma_flush();

    RUN_TEST(test_usart6_loopback_0xa5);
    RUN_TEST(test_usart6_loopback_0x00);
    RUN_TEST(test_usart6_loopback_0xff);
    RUN_TEST(test_usart6_loopback_sequence);

    /* ----------------------------------------------------------
     * Tier 5: GPIO output/input loopback tests
     *   PA9 (output) wired to PB7 (input) — UART1 loopback cable
     *   PC6 (output) wired to PC7 (input) — UART6 loopback cable
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: GPIO loopback ---\n");
    printf_dma_flush();

    RUN_TEST(test_gpio_loopback_pa9_pb7);   /* HIGH, LOW, toggle — PA9<->PB7 */
    RUN_TEST(test_gpio_loopback_pc6_pc7);   /* HIGH, LOW         — PC6<->PC7 */

    /* ----------------------------------------------------------
     * Tier 5: EXTI interrupt tests
     *   PA9 (output) wired to PB7 (input, EXTI line 7 port B)
     *   Both edges tested in one function; software trigger separate.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: EXTI loopback (PA9->PB7, line 7) ---\n");
    printf_dma_flush();

    RUN_TEST(test_exti_both_edges_pb7);
    RUN_TEST(test_exti_software_trigger_pb7);

    /* ----------------------------------------------------------
     * Tier 6: Flash hardware tests
     *   Single erase of sector 1, then write/read at different offsets.
     *   1 erase cycle per CI run → ~10K runs before wear-out.
     *   No external wiring required.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 6: Flash erase/write/read (sector 1) ---\n");
    printf_dma_flush();

    RUN_TEST(test_flash_erase_sector1);
    RUN_TEST(test_flash_write_word_readback);
    RUN_TEST(test_flash_write_bytes_readback);
    RUN_TEST(test_flash_sector_info);

    /* ----------------------------------------------------------
     * Tier 7: CRC hardware tests
     *   Pure internal peripheral — no external wiring.
     *   Validates CRC-32 (MPEG-2 polynomial 0x04C11DB7).
     * ---------------------------------------------------------- */
    printf("\n--- Tier 7: CRC hardware ---\n");
    printf_dma_flush();

    RUN_TEST(test_crc_hw_known_vector);
    RUN_TEST(test_crc_hw_reset_restores_init);
    RUN_TEST(test_crc_hw_accumulate_matches_sequential);
    RUN_TEST(test_crc_hw_flash_region);
    RUN_TEST(test_crc_hw_performance);

    /* ----------------------------------------------------------
     * Tier 8: Low-power Stop mode test
     *   Uses EXTI software trigger to wake immediately.
     *   No external wiring required.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 8: Stop mode enter/wake ---\n");
    printf_dma_flush();

    RUN_TEST(test_stop_mode_enter_and_wake);

    printf_dma_flush();
    return UNITY_END();
}

#endif /* HIL_TEST_MODE */
